#Задача по программированию:Hello,%username!
name = input('Введите имя:')
print('Hello, ' + name + '!')