# Входные данные:150

# Вывод программы:2 30

a = int(input())
b = a // 60 % 24
c = a % 60
print(b, c)
