# Входные данные:
# 8
# 5

# Вывод программы:
# 8

a = int(input())
b = int(input())
print(max(a, b))
