# Входные данные:
# 3
# 14

# Вывод программы:4
a = int(input())
b = int(input())
print(b // a)
