# Задача по программированию:Дележ двойки-2

# Входные данные:3 14
# Вывод данных:4

a, b = input() .split()
a = int(a)
b = int(b)
print(b // a)
