# Входные данные:
# 10
# 5

# Вывод программы:
# Yes

a = int(input())
b = int(input())
if a % b == 0:
    print("YES")
else:
    print("NO")
