# Входные данные: 0

# Вывод программы: 0
a = input()
print((int(a * 100) ** 2))
