# Входные данные: 0

# Вывод программы: 0
a = int(input())
print((a * 100) ** 2)
