# Входные данные:
# 10
# 15
# 2

# Вывод программы:20 30

a = int(input())
b = int(input())
с = int(input())
cost = с * (100 * a + b)
print(cost // 100, cost % 100)
