# Входные данные:
# 700
# 750

# Вывод программы:
# 2

import math
n = int(input())
m = int(input())
x = m / n
print(math.ceil(x))
