# Задача по программированию:Степень двойки

# Входные данные:2
# Вывод данных:4

a = int(input())
print(2 ** a)
