# Входные данные:
# 8
# 5

# Вывод программы:
# 8

a = int(input())
b = int(input())
x = abs(a - b)
print((a + b - x) // 2 + x)
