# Входные данные:7, 8

# Вывод программы:8, 10
a = int(input())
print((a//2+1)*2)
