# Входные данные:
# 60
# 2

# Вывод программы: 11

a = int(input())
b = int(input())
print((a * b) % 109)
