# Входные данные:0, 1

# Вывод программы:1, 0
a = int(input())
print(1 - a)
