#Задача по программированию:Дележ двойки-2

#Входные данные:3 14
#Вывод данных:4

a, b = int(input("Введите кол-во шккольников и кол-во яблок:" ))
print(b // a)