#Составить программу вывода на экран вещественного числа, вводимого с клавиатуры.
#Выводимому числу должно предшествовать сообщение "Вы ввели число" (без кавычек).
#Sample Input:7.54
#Sample Output: Вы ввели число 7.54
# put your python code here
a = float( input())
print("Вы ввели число",a)