# Напишите программу ввода двух строк (каждая вводится с новой строки)
# и их объединения в одну строку через пробел.
# Результат выведите на экран.

# Sample Input:
# hello python
# i love you
# Sample Output: hello python i love you

# put your python code here
s1 = input()
s2 = input()
print(s1 + ' ' + s2)
